#### Importações

In [49]:
import pandas as pd
import os
import glob
import datetime
import math
from  sqlalchemy import *
from minio import Minio

---
#### Etapa1 - Extração dos dados nas fontes

##### 1.1 - Dados do departamento de RH

In [4]:
# Estabelecendo conexão
url = 'mysql+pymysql://root:12345@127.0.0.1:3307/employees'
engine = create_engine(url, echo=True)
connection = engine.connect()

2022-03-17 17:47:09,305 INFO sqlalchemy.engine.Engine SHOW VARIABLES LIKE 'sql_mode'
2022-03-17 17:47:09,306 INFO sqlalchemy.engine.Engine [raw sql] {}
2022-03-17 17:47:09,319 INFO sqlalchemy.engine.Engine SHOW VARIABLES LIKE 'lower_case_table_names'
2022-03-17 17:47:09,319 INFO sqlalchemy.engine.Engine [generated in 0.00087s] {}
2022-03-17 17:47:09,325 INFO sqlalchemy.engine.Engine SELECT DATABASE()
2022-03-17 17:47:09,326 INFO sqlalchemy.engine.Engine [raw sql] {}

In [5]:
# Extração dos dados
query = """ SELECT * FROM employees """
df_rh = pd.read_sql_query(query, connection)
df_rh.head()

2022-03-17 17:47:09,432 INFO sqlalchemy.engine.Engine  SELECT * FROM employees
2022-03-17 17:47:09,433 INFO sqlalchemy.engine.Engine [raw sql] {}

   emp_no birth_date first_name last_name gender department  left   hire_date
0   10001 1953-09-02     Georgi   Facello      M      sales     1  2018-01-17
1   10002 1964-06-02    Bezalel    Simmel      F      sales     1  2015-02-02
2   10003 1959-12-03      Parto   Bamford      M      sales     1  2017-01-22
3   10004 1954-05-01  Chirstian   Koblick      M      sales     1  2016-01-28
4   10005 1955-01-21    Kyoichi  Maliniak      M      sales     1  2018-01-17

##### 1.2 - Dados de desempenho e avaliação de satisfação dos funcionários

In [6]:
# O diretório do datalake está mapeado na máquina, por isso não é necessário estabelecer conexão com o servidor do Minio
evaluation_data_file = "C:\Projeto_RHAnalytics\datalake\landing\performance-evaluation\employee_performance_evaluation.json"
df_evaluation = pd.read_json(evaluation_data_file, lines=True)
df_evaluation.head(5)

   emp_id  satisfaction_level  last_evaluation
0   10001                  38               53
1   10002                  80               86
2   10003                  11               88
3   10004                  72               87
4   10005                  37               52

##### 1.3 - Dados da folha de ponto (horas trabalhadas)

In [10]:
hours_data_files = "C:\Projeto_RHAnalytics\datalake\landing\working-hours\*.xlsx"
df_hours = pd.DataFrame(data=None, columns=["emp_id","data","hora"])

for sheet in glob.glob(hours_data_files):
    df_ = pd.read_excel(sheet)
    df_hours = pd.concat([df_hours,df_])

In [11]:
df_hours.head(5)

    emp_id       data  hora
0  20001.0 2020-05-31  10.0
1  20001.0 2020-06-01  11.0
2  20001.0 2020-06-02   4.0
3  20001.0 2020-06-03   7.0
4  20001.0 2020-06-04   7.0

---
#### Etapa2 - Modelagem de atributos que serão usados como variáveis preditoras

##### Número de Projetos

In [22]:
query = """
            SELECT emp_id, COUNT(DISTINCT project_id) as number_of_projects
            FROM projects_emp 
            GROUP BY emp_id;        
        """

In [24]:
df_projects_employee = pd.read_sql_query(query, connection)
df_projects_employee.head()

2022-03-17 18:06:41,985 INFO sqlalchemy.engine.Engine
            SELECT emp_id, COUNT(DISTINCT project_id) as number_of_projects
            FROM projects_emp
            GROUP BY emp_id;

2022-03-17 18:06:41,987 INFO sqlalchemy.engine.Engine [raw sql] {}

   emp_id  number_of_projects
0   10001                   2
1   10002                   5
2   10003                   7
3   10004                   5
4   10005                   2

##### Carga de trabalho: 

Utiliza a média de horas mensais trabalhadas, baseado nos últimos 3 meses.

In [33]:
df_hours["data"].min(), df_hours["data"].max(),

(Timestamp('2020-05-31 00:00:00'), Timestamp('2020-12-31 00:00:00'))

In [128]:

threshold_date = datetime.datetime(2020,9,30)
df_last_three_months = df_hours[df_hours["data"] >  threshold_date]
mean_worked_hours_three_months = pd.DataFrame(df_last_three_months.groupby("emp_id")["hora"].agg("sum")/3)
mean_worked_hours_three_months.rename(columns={"emp_id": "emp_id", "hora": "mean_worked_hours"}, inplace=True)

In [129]:
mean_worked_hours_three_months.head(3)

         mean_worked_hours
emp_id
10001.0         266.000000
10002.0         252.000000
10003.0         289.666667

##### Tempo na empresa

In [122]:
df_hire_date =  df_rh.loc[:, ["emp_no", "hire_date"]]
df_hire_date["hire_date"] = pd.to_datetime(df_hire_date["hire_date"])

# Diferença em anos
today = datetime.datetime(2021, 1, 1) #equivale a data atual, porém é fictícia
diff_years = [ math.ceil((today - date).days/365) for date in df_hire_date["hire_date"]]
df_hire_date["time_in_company"] = diff_years

df_hire_date.head(3)

   emp_no  hire_date  time_in_company
0   10001 2018-01-17                3
1   10002 2015-02-02                6
2   10003 2017-01-22                4

Acidentes de trabalho

In [140]:
query = """ SELECT DISTINCT(emp_no) FROM accident """
work_accidents = pd.read_sql_query(query, connection)
work_accidents.head(1)

2022-03-17 19:03:08,104 INFO sqlalchemy.engine.Engine  SELECT DISTINCT(emp_no) FROM accident
2022-03-17 19:03:08,106 INFO sqlalchemy.engine.Engine [raw sql] {}

   emp_no
0   10019

In [164]:
#[if emp in df_work_accident["emp_no"] 1 else 0 for emp in df_work_accident["emp_no"]]
df_work_accident = pd.DataFrame(data=df_hire_date["emp_no"])
df_work_accident["work_accident"] = [1 if emp in list(work_accidents["emp_no"]) else 0 for emp in df_work_accident["emp_no"]]

##### Departamento, Salário e Se deixou a empresa

In [170]:
query = """
            SELECT employees.emp_no, employees.department, employees.left, salaries.salary
            FROM employees INNER JOIN salaries
            ON employees.emp_no = salaries.emp_id;
        """
df_dpto_salary_left = pd.read_sql_query(query, connection)

2022-03-17 19:20:32,142 INFO sqlalchemy.engine.Engine
            SELECT employees.emp_no, employees.department, employees.left, salaries.salary
            FROM employees INNER JOIN salaries
            ON employees.emp_no = salaries.emp_id;

2022-03-17 19:20:32,144 INFO sqlalchemy.engine.Engine [raw sql] {}